In [2]:
%load_ext sql
%sql sqlite:///Weather2.db

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

## 문제 1 [SQL]
Regions table에서 coastal이 'Y'인 행의 갯수와 'N'인 행의 갯수를 구하고 행의 갯수의 오름차순으로 출력하시오. 1개의 Query만 사용하고 어떤 갯수가 'Y'의 갯수이고 'N'의 갯수인지 명확히 출력하여야 함

In [187]:
%%sql

Select Coastal,count(*) as 'coastal count'
From regions

Group by coastal
Order by coastal asc

 * sqlite:///Weather2.db
Done.

[('N', 24), ('Y', 19)]

## 문제 2 [SQL]
1. 강의시간에 배운 두 table에 대한 Join은 where clause에 두 table이 공유하는 열이 서로 같다는 조건을 줌으로써 이루어 졌음.
1. sql에서는 join을 위해 where clause에 조건을 줄 필요가 없는(where clause를 사용할 필요가 없는) inner join이라는 기능을 제공하고 있음. 이 기능을 이용하여  CityTemps table에 Regions table을 병합하고, 모든 region과 coastal의 combination에 대하여 lat의 최소값과 lng의 최소값을 출력하시오. inner join 기능을 어떻게 사용하는지는 구글 검색 등을 이용하여 찾아내시오.
1. 1개의 Query만 사용하여 문제를 푸시오.

In [163]:
%%sql
Select region, coastal, min(lat), min(lng)

From CityTemps
    inner join Regions
    ON CityTemps.state = Regions.state
    
Group by Region, Coastal

 * sqlite:///Weather2.db
Done.

[('Midatlantic', 'N', 40.9, 75.5),
 ('Midatlantic', 'Y', 39.8, 73.7),
 ('Mountain', 'N', 33.6, 104.9),
 ('Northcentral', 'N', 38.1, 82.5),
 ('Northeast', 'N', 45.0, 73.9),
 ('Northeast', 'Y', 41.7, 70.5),
 ('Pacific', 'Y', 45.6, 117.9),
 ('Southatlantic', 'Y', 25.0, 76.3),
 ('Southcentral', 'N', 35.4, 86.5),
 ('Southcentral', 'Y', 29.4, 86.8)]

## 문제 3 [PYTHON]
CityTemps.csv와 Regions.tsv를 각각 df1과 df2라는 dataframe으로 읽어 들이시오. 그후 df1에 df2를 pandas의 merge 함수를 이용하여 병합하고, groupby 함수를 이용하여 region과 coastal의 combination을 만들고 lat과 lng의 최소값을 출력하시오. 문제 2번의 sql문제와 똑같은 답이 나와야 함.

In [197]:
import pandas as pd
df1 = pd.read_csv("CityTemps.csv")
df2 = pd.read_csv("Regions.tsv", sep='\t')

merge1 = df1.merge(df2, on='state')
arr= merge1.groupby(['region', 'coastal'])
arr[['lat', 'lng']].min()

                        lat    lng
region        coastal
Midatlantic   N        40.9   75.5
              Y        39.8   73.7
Mountain      N        33.6  104.9
Northcentral  N        38.1   82.5
Northeast     N        45.0   73.9
              Y        41.7   70.5
Pacific       Y        34.3  117.9
Southatlantic Y        25.0   76.3
Southcentral  N        35.4   86.5
              Y        29.4   86.8

## 문제 4 [PYTHON]
CityTemps.csv를 dictionary 형태로 읽어들여 cities라는 이름의 list에 넣으시오. cities에 있는 dictionary들중 마지막에서 세번째 있는 dictionary를 출력하고, 또한 가장 마지막에 있는 dictionary의 temp값도 출력하시오.

In [139]:
import csv
cities = [ ]
with open('cityTemps.csv','r') as cityfile:
    city = csv.DictReader(cityfile)
    for row in city:
        cities.append(row)
    
print(cities[-3])
print()
print('temp == '+cities[-1]['temp']+'˚c')

OrderedDict([('city', 'Madison'), ('state', 'Wisconsin'), ('lat', '43.4'), ('lng', '90.2'), ('temp', '9')])

temp == 14˚c

## 문제 5 [PYTHON]
property data2.csv에는 standard/non-standard/unexpected missing value가 섞여있다. 이 세가지의 모든 missing value를 한번에 NULL로 인식하면서 읽어들여 dataframe df에 저장하고 각 열별 NULL의 갯수를 출력하시오. 
### property data.csv가 아니고 property data2.csv를 사용해야 합니다

In [161]:
df = pd.read_csv('property data2.csv')
missing_values = ['?? ', 'NAN', '10203']
df = pd.read_csv('property data2.csv', na_values = missing_values)
df.isnull().sum()

PID             1
ST_NUM          1
ST_NAME         0
OWN_OCCUPIED    1
NUM_BEDROOMS    3
NUM_BATH        2
SQ_FT           2
dtype: int64